int programm, number;
Boolean begin = true;

while (begin)
{
    Console.WriteLine("-----------------------------------------------------------------------------");
    Console.WriteLine("Введите число для соответствующей задачи или иное для выхода: ");
    Console.WriteLine("1. Напишите программу, которая на вход принимает пятизначное число и проверяет, является ли оно палиндромом.");
    Console.WriteLine("2. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.");
    Console.WriteLine("3. Напишите программу, которая принимает на вход число(N) и выдает таблицу чисел от 1 до N.");
    programm = Convert.ToInt32(Console.ReadLine());
    
    switch (programm)
    {
        case 1:
            // Задача 19. Напишите программу, котора на вход принимает пятизначное число и проверяет, является ои оно палиндромом.
            /*  14212-> нет
                12821-> да
                23432-> да  */                      

            int number1 = ReadInt("Введите пятизначное число: ");
            int amount = number1.ToString().Length;

             int ReadInt(string message)
            {
                Console.WriteLine(message);
                return Convert.ToInt32(Console.ReadLine());
            }












            break;

        case 2:
            // Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
            /*  А(3,6,8); В(2,1,-7), -> 15.84
                А(7,-5,0); В(1,-1,9), -> 11,53 */




            break;


        case 3:
            // Задача 23. Напишите программу, которая принимает на вход число(N) и выдает таблицу чисел от 1 до N.
            /*  3-> 1, 8, 27
                5-> 1, 8, 27, 125 */
  
            break;
    }
}